In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
%sql postgresql://ywang:Love520!@127.0.0.1/sparkifydb

'Connected: ywang@sparkifydb'

In [20]:
%sql SELECT * FROM songplay LIMIT 5;

 * postgresql://ywang:***@127.0.0.1/sparkifydb
5 rows affected.

[(None, datetime.datetime(1970, 1, 1, 0, 25, 41, 470384), 100, 'free', None, 248, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (None, datetime.datetime(1970, 1, 1, 0, 25, 41, 470633), 100, 'free', None, 248, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (None, datetime.datetime(1970, 1, 1, 0, 25, 41, 474049), 61, 'free', None, 252, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (None, datetime.datetime(1970, 1, 1, 0, 25, 41, 480172), 55, 'free', None, 250, 'Minneapolis-St. Paul-Bloomington, MN-WI', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (None, datetime.datetime(1970, 1, 1, 0, 25, 41, 480199), 55, 'free', None, 250, 'Minneapolis-St. Paul-Bloomington, MN-WI', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [16]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://ywang:***@127.0.0.1/sparkifydb
5 rows affected.

[('100', 'Adler', 'Barrera', 'M', 'free'),
 ('100', 'Adler', 'Barrera', 'M', 'free'),
 ('61', 'Samuel', 'Gonzalez', 'M', 'free'),
 ('55', 'Martin', 'Johnson', 'M', 'free'),
 ('55', 'Martin', 'Johnson', 'M', 'free')]

In [17]:
%sql SELECT * FROM song LIMIT 5;

 * postgresql://ywang:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 0, 'ARD7TVE1187B99BFB1', 218.932)]

In [14]:
%sql SELECT * FROM artist LIMIT 5;

 * postgresql://ywang:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', 'NaN', 'NaN')]

In [15]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://ywang:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(1970, 1, 1, 0, 25, 41, 470384), 0, 1, 1, 1, 1970, 3),
 (datetime.datetime(1970, 1, 1, 0, 25, 41, 470633), 0, 1, 1, 1, 1970, 3),
 (datetime.datetime(1970, 1, 1, 0, 25, 41, 474049), 0, 1, 1, 1, 1970, 3),
 (datetime.datetime(1970, 1, 1, 0, 25, 41, 480172), 0, 1, 1, 1, 1970, 3),
 (datetime.datetime(1970, 1, 1, 0, 25, 41, 480199), 0, 1, 1, 1, 1970, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).